{
  "en": {
    "description-1": "Super Secret Samples is a library React Router app for downloading audio samples tailored to professional music producers seeking unique, high-quality samples. The samples are guaranteed royalty-free and lovingly homemade with care and attention.",
    "description-2": "Users can search for samples by music genre, instrument, tempo, key, and various tags. They can download these royalty-free samples directly to use in their productions. Additionally, users can request the creation and upload of samples based on their specific criteria and may obtain exclusive access to these custom samples.",
    "description-3": "Super Secret Samples was created to combine my two passions: coding and music production. This project allowed me to explore React Router and deepen my skills in React, React Router, Tailwind, Prisma, Postgres, Vitest, and Jest. Ironically, one of the biggest challenges of this project was an invisible part of the site for regular users: the sample upload form. To anticipate the possible onboarding of other sample creators, I developed a drop-zone and a form to streamline the process of uploading samples to AWS S3 while synchronizing and saving metadata in the Postgres database.",
    "description-3.5": "Since the app & samples are protected via a password, I created a showroom branch with a small selection of samples for demo purposes. To maintain synchronisation between the two branches, I added checks, created a db branch and a separate S3 bucket. The app can then be deployed on the two branches without any change",
    "description-4": "This app is clearly the most complex and accomplished of all my projects. I thoroughly enjoyed discovering React Router, deepening my knowledge of React, Prisma, Postgres, and S3, as well as delving into the design aspect. I put significant effort into crafting a unique branding for Super Secret Samples and delivering a UX/UI that feels as professional as possible."
  },
  "fr": {
    "description-1": "Super secret samples est une app React Router de bibliothèque de samples audio pour producteurs de musique professionnels qui recherchent des samples uniques et de grande qualité. Les samples sont garantis royaltee-free et faits-maison avec amour et soin.",
    "description-2": "Les utilisateurs peuvent rechercher des samples par genre musical, instrument, tempo, tonalité et tags. Ils peuvent télécharger directement ces samples libres de droits pour les utiliser dans leurs productions. Les utilisateurs peuvent également demander la création et l'upload de samples selon leurs critères, et peuvent obtenir les samples exclusivement.",
    "description-3": "Super secret samples a été créé dans le but d'allier mes deux passions que sont le code et la production de musique. J'en ai profité pour découvrir React Router et approfondir mes compétences en React, React Router, Tailwind, Prisma, Postgres, Vitest et Jest. L'un des plus gros challenge de ce projet a ironiquement été une partie du site invisible des utilisateurs lambda : le formulaire d'upload des samples. Afin d'anticiper la venue possible d'autres créateurs de samples, j'ai créé une drop-zone et un formulaire pour faciliter l'upload de samples dans AWS S3 et la synchronisation/enregistrement des metadata dans la base de donnée Postgres.",
    "description-3.5": "Comme l'app et les samples sont protégés par un mot de passe, j'ai créé une branche showroom avec une petite sélection de samples à des fins de démonstration. Pour maintenir la synchronisation entre les deux branches, j'ai ajouté des vérifications, créé une nouvelle branche de la DB et un bucket S3 séparé. L'application peut ainsi être déployée sur les deux branches sans aucune modification.",
    "description-4": "Cette app est sans doute le plus complexe et le plus abouti de tous mes projets. J'ai beaucoup aimé découvrir React Router, en apprendre plus sur React, Prisma, Postgres et S3, mais aussi toute la partie design que j'ai essayé de soigner le plus possible afin de donner à super secret samples un branding original, ainsi qu'une UX/UI la plus professionnelle possible."
  }
}
